[
    {
        "name": "Couscous",
        "country": "Maroc",
        "photo_url": "images/couscous.jpg",
        "cooking_time": "60 min",
        "preparation": "1. Dans une grande casserole, chauffez l'huile d'olive et faites revenir les oignons jusqu'à ce qu'ils soient dorés.\n2. Ajoutez les morceaux de viande et faites-les dorer de tous les côtés.\n3. Incorporez les légumes coupés en morceaux (carottes, courgettes, navets) et faites-les revenir pendant quelques minutes.\n4. Ajoutez les épices (ras el hanout, sel, poivre, safran) et mélangez bien.\n5. Versez de l'eau jusqu'à couvrir la viande et les légumes, puis laissez mijoter à feu moyen pendant environ 45 minutes.\n6. Pendant ce temps, préparez le couscous selon les instructions du paquet.\n7. Servez la viande et les légumes sur un lit de couscous, arrosés de bouillon."
    },
    {
        "name": "Pastilla Poulet",
        "country": "Maroc",
        "photo_url": "images/pastilla.jpg",
        "cooking_time": "90 min",
        "preparation": "1. Dans une grande poêle, faites chauffer de l'huile et faites revenir les oignons jusqu'à ce qu'ils soient tendres.\n2. Ajoutez les morceaux de poulet et faites-les cuire jusqu'à ce qu'ils soient bien dorés.\n3. Ajoutez les épices (cannelle, safran, gingembre, sel, poivre) et mélangez bien.\n4. Ajoutez un peu d'eau et laissez mijoter jusqu'à ce que le poulet soit bien cuit et que le liquide soit réduit.\n5. Effilochez le poulet et mélangez-le avec les amandes grillées et moulues, le sucre glace et la cannelle.\n6. Beurrez une feuille de brick et placez-la dans un moule à tarte.\n7. Garnissez avec le mélange de poulet et recouvrez avec une autre feuille de brick beurrée.\n8. Répétez l'opération jusqu'à épuisement des ingrédients.\n9. Faites cuire au four préchauffé à 180°C pendant environ 30 minutes, jusqu'à ce que la pastilla soit dorée et croustillante.\n10. Saupoudrez de sucre glace et de cannelle avant de servir."
    },
    {
        "name": "Bacalhau à Brás",
        "country": "Portugal",
        "photo_url": "images/bacalhau.jpg",
        "cooking_time": "40 min",
        "preparation": "1. Dessalez le bacalhau en le trempant dans l'eau pendant 24 à 48 heures, en changeant l'eau régulièrement.\n2. Faites cuire le bacalhau dans de l'eau bouillante pendant environ 10 minutes, puis égouttez et émiettez-le.\n3. Dans une grande poêle, faites revenir les oignons émincés et l'ail dans de l'huile d'olive jusqu'à ce qu'ils soient tendres.\n4. Ajoutez le bacalhau émietté et faites revenir pendant quelques minutes.\n5. Ajoutez les pommes de terre allumettes préalablement frites et mélangez bien.\n6. Battez les œufs et ajoutez-les à la poêle, en remuant constamment jusqu'à ce qu'ils soient cuits mais encore moelleux.\n7. Assaisonnez avec du sel, du poivre et du persil haché.\n8. Servez chaud, garni d'olives noires et de persil frais."
    },
    {
        "name": "Pastéis de Nata",
        "country": "Portugal",
        "photo_url": "images/pasteis.jpg",
        "cooking_time": "50 min",
        "preparation": "1. Préchauffez le four à 220°C (425°F).\n2. Étalez la pâte feuilletée et découpez des cercles pour tapisser des moules à muffins ou des moules à pastéis de nata.\n3. Dans une casserole, mélangez le sucre, l'eau et le bâton de cannelle, puis portez à ébullition jusqu'à ce que le sucre soit dissous.\n4. Dans un bol, mélangez la farine et un peu de lait pour obtenir une pâte lisse.\n5. Ajoutez le reste du lait et la crème, puis incorporez le sirop de sucre chaud en remuant constamment.\n6. Retirez le bâton de cannelle et laissez refroidir légèrement.\n7. Ajoutez les jaunes d'œufs et mélangez bien.\n8. Remplissez les moules avec le mélange et faites cuire au four pendant 15-20 minutes, jusqu'à ce que les pastéis soient dorés et caramélisés.\n9. Laissez refroidir avant de démouler et de servir."
    },
    {
        "name": "Sushi",
        "country": "Japon",
        "photo_url": "images/sushi.jpg",
        "cooking_time": "60 min",
        "preparation": "1. Rincez le riz à sushi jusqu'à ce que l'eau soit claire, puis laissez-le égoutter pendant 30 minutes.\n2. Faites cuire le riz avec de l'eau selon les instructions du paquet.\n3. Pendant ce temps, mélangez le vinaigre de riz, le sucre et le sel dans une petite casserole et faites chauffer jusqu'à ce que le sucre soit dissous. Laissez refroidir.\n4. Lorsque le riz est cuit, transférez-le dans un grand bol et incorporez le mélange de vinaigre tout en ventilant le riz pour qu'il refroidisse rapidement.\n5. Préparez vos garnitures : poissons crus tranchés, légumes coupés en julienne, avocat, etc.\n6. Sur une natte en bambou recouverte de film plastique, étalez une feuille de nori, puis répartissez une fine couche de riz en laissant une marge en haut.\n7. Disposez les garnitures au centre, puis roulez fermement en vous aidant de la natte.\n8. Coupez les rouleaux en morceaux égaux et servez avec de la sauce soja, du gingembre mariné et du wasabi."
    },
    {
        "name": "Ramen",
        "country": "Japon",
        "photo_url": "images/ramen.jpg",
        "cooking_time": "90 min",
        "preparation": "1. Dans une grande casserole, faites chauffer l'huile et faites revenir l'ail, le gingembre et l'oignon jusqu'à ce qu'ils soient parfumés.\n2. Ajoutez le bouillon de poulet et portez à ébullition.\n3. Ajoutez le miso, la sauce soja et le sake, puis réduisez le feu et laissez mijoter pendant 30 minutes.\n4. Pendant ce temps, faites cuire les nouilles ramen selon les instructions du paquet.\n5. Préparez vos garnitures : œufs mollets, tranches de porc chashu, nori, oignons verts hachés, champignons shiitake, etc.\n6. Lorsque le bouillon est prêt, filtrez-le pour enlever les solides.\n7. Répartissez les nouilles cuites dans des bols, versez le bouillon chaud par-dessus et ajoutez les garnitures.\n8. Servez immédiatement."
    },
    {
        "name": "Poulet Tikka Masala",
        "country": "Inde",
        "photo_url": "images/tikka_masala.jpg",
        "cooking_time": "50 min",
        "preparation": "1. Dans un bol, mélangez le yaourt, le jus de citron, l'ail, le gingembre, le garam masala, le curcuma, le cumin, le paprika, le sel et le poivre.\n2. Ajoutez les morceaux de poulet et mélangez bien pour les enrober. Laissez mariner au réfrigérateur pendant au moins 30 minutes.\n3. Faites chauffer de l'huile dans une grande poêle et faites cuire le poulet mariné jusqu'à ce qu'il soit doré et cuit. Retirez-le de la poêle et réservez.\n4. Dans la même poêle, faites revenir l'oignon jusqu'à ce qu'il soit tendre.\n5. Ajoutez l'ail et le gingembre, et faites cuire pendant encore une minute.\n6. Ajoutez les tomates concassées, la crème, et laissez mijoter pendant 10 minutes.\n7. Remettez le poulet dans la poêle et laissez mijoter pendant 10 minutes de plus.\n8. Servez chaud, garni de coriandre fraîche et accompagné de riz basmati ou de naan."
    },
    {
        "name": "Chana Masala",
        "country": "Inde",
        "photo_url": "images/chana_masala.jpg",
        "cooking_time": "45 min",
        "preparation": "1. Faites chauffer l'huile dans une grande poêle et faites revenir l'oignon jusqu'à ce qu'il soit doré.\n2. Ajoutez l'ail, le gingembre et les piments verts, et faites cuire pendant une minute de plus.\n3. Ajoutez les épices (cumin, coriandre, curcuma, paprika, garam masala) et faites cuire pendant quelques minutes jusqu'à ce qu'elles soient parfumées.\n4. Ajoutez les tomates concassées et laissez cuire pendant 10 minutes jusqu'à ce qu'elles soient bien réduites.\n5. Ajoutez les pois chiches, le sel et un peu d'eau, puis laissez mijoter pendant 20 minutes.\n6. Ajoutez le jus de citron et la coriandre fraîche.\n7. Servez chaud avec du riz ou du pain naan."
    },
    {
        "name": "Tiramisu",
        "country": "Italie",
        "photo_url": "images/tiramisu.jpg",
        "cooking_time": "30 min",
        "preparation": "1. Séparez les blancs des jaunes d'œufs.\n2. Fouettez les jaunes d'œufs avec le sucre jusqu'à ce que le mélange blanchisse.\n3. Ajoutez le mascarpone et mélangez jusqu'à obtenir une crème lisse.\n4. Montez les blancs en neige ferme et incorporez-les délicatement à la crème au mascarpone.\n5. Trempez rapidement les biscuits à la cuillère dans le café refroidi et disposez-les dans le fond d'un plat.\n6. Couvrez avec la moitié de la crème au mascarpone.\n7. Répétez l'opération avec une deuxième couche de biscuits trempés et le reste de la crème.\n8. Saupoudrez de cacao en poudre.\n9. Réfrigérez pendant au moins 4 heures avant de servir."
    },
    {
        "name": "Spaghetti Carbonara",
        "country": "Italie",
        "photo_url": "images/carbonara.jpg",
        "cooking_time": "25 min",
        "preparation": "1. Faites cuire les spaghetti dans une grande casserole d'eau bouillante salée jusqu'à ce qu'ils soient al dente.\n2. Pendant ce temps, faites revenir les lardons dans une poêle jusqu'à ce qu'ils soient dorés et croustillants.\n3. Dans un bol, battez les œufs avec le parmesan râpé et une bonne quantité de poivre noir.\n4. Égouttez les spaghetti en réservant une tasse d'eau de cuisson.\n5. Ajoutez les spaghetti chauds dans la poêle avec les lardons et mélangez bien.\n6. Retirez la poêle du feu et ajoutez le mélange d'œufs et de fromage, en remuant rapidement pour éviter que les œufs ne cuisent trop.\n7. Ajoutez un peu d'eau de cuisson réservée pour obtenir une sauce crémeuse.\n8. Servez immédiatement avec du parmesan râpé supplémentaire."
    },
    {
        "name": "Ratatouille",
        "country": "France",
        "photo_url": "images/ratatouille.jpg",
        "cooking_time": "60 min",
        "preparation": "1. Coupez les légumes (aubergines, courgettes, poivrons, tomates) en dés.\n2. Faites chauffer l'huile d'olive dans une grande poêle et faites revenir l'oignon et l'ail jusqu'à ce qu'ils soient tendres.\n3. Ajoutez les aubergines et les courgettes et faites cuire pendant 10 minutes.\n4. Ajoutez les poivrons et faites cuire pendant encore 10 minutes.\n5. Ajoutez les tomates, le thym, le laurier, le sel et le poivre.\n6. Laissez mijoter à feu doux pendant 30 minutes, en remuant de temps en temps.\n7. Servez chaud ou froid, garni de basilic frais."
    },
    {
        "name": "Tarte aux Pommes",
        "country": "France",
        "photo_url": "images/tarte_pommes.jpg",
        "cooking_time": "45 min",
        "preparation": "1. Préchauffez le four à 180°C (350°F).\n2. Étalez la pâte brisée dans un moule à tarte et piquez le fond avec une fourchette.\n3. Épluchez, épépinez et coupez les pommes en tranches fines.\n4. Disposez les tranches de pommes sur la pâte en formant une rosace.\n5. Saupoudrez de sucre et de quelques noisettes de beurre.\n6. Faites cuire au four pendant 30 à 35 minutes, jusqu'à ce que la pâte soit dorée et les pommes tendres.\n7. Faites chauffer la confiture d'abricots avec un peu d'eau et badigeonnez la tarte pour la rendre brillante.\n8. Laissez refroidir avant de servir."
    }
]
